const { SlashCommandBuilder, EmbedBuilder } = require('discord.js');

module.exports = {
    data: new SlashCommandBuilder()
        .setName('games')
        .setDescription('عرض شرح مفصل لكيفية لعب الألعاب المتاحة'),

    async execute(interaction) {
        // إعداد محتوى الـ Embed
        const embed = new EmbedBuilder()
            .setTitle('شرح كيفية لعب الألعاب المتاحة')
            .setColor('#5865F2')
            .setDescription('فيما يلي شرح مفصل لكل لعبة يمكنك لعبها :')
            .addFields(
                { 
                    name: '2048',
                    value: 'لعبة 2048 هي لعبة ألغاز تعتمد على تحريك البلاط المرقّم في مصفوفة 4x4 لدمج البلاط المتطابقين حتى تصل إلى الرقم 2048. استخدم الأزرار لتوجيه البلاط في الاتجاهات الأربعة (أعلى، أسفل، يسار، يمين) حتى تصل إلى الهدف.'
                },
                {
                    name: 'Connect4',
                    value: 'في لعبة Connect4، يحاول اللاعبون وضع أربع قطع ملونة في صف واحد (أفقياً، عمودياً، أو قطرياً) قبل خصمهم. كل لاعب يتناوب في وضع قطعة في أحد الأعمدة حتى يمتلك أحد اللاعبين أربعة قطع متتالية.'
                },
                {
                    name: 'Minesweeper',
                    value: 'في لعبة Minesweeper، الهدف هو كشف جميع الخلايا دون الكشف عن الألغام. يمكنك النقر على الخلايا لكشفها، وإذا وجدت لغمًا، ستنتهي اللعبة. هناك أزرار لوضع أعلام على الألغام المشتبه بها.'
                },
                {
                    name: 'Match Pairs',
                    value: 'في لعبة Match Pairs، الهدف هو العثور على أزواج من الرموز المطابقة عن طريق النقر على الأزرار. يمكنك فقط رؤية رمز واحد في كل مرة. حاول العثور على جميع الأزواج بأقل عدد من المحاولات.'
                },
                {
                    name: 'Snake',
                    value: 'في لعبة Snake، تتحكم في ثعبان يتنقل حول الشاشة لالتهام الطعام وتنمو طوله. يجب عليك تجنب الاصطدام بجدران الشاشة أو بنفسك. تحكم في الثعبان باستخدام الأسهم (أعلى، أسفل، يسار، يمين).'
                },
                {
                    name: 'xo',
                    value: 'في لعبة xo، يلعب لاعبان بالتناوب لوضع علامات X أو O في شبكة 3x3. الهدف هو وضع ثلاث علامات متتالية في صف واحد (أفقياً، عمودياً، أو قطرياً) للفوز باللعبة.'
                }
            )
            .setTimestamp()
            .setFooter({ text: 'استمتع بالألعاب!' });

        // إرسال الـ Embed إلى القناة
        await interaction.reply({ embeds: [embed] });
    }
};
